[
  {
    "keywords": ["activity", "location", "going", "where"],
    "response": "Always figure out which activity and location the customer wants. If they aren’t sure, ask where they are or where they’re going."
  },
  {
    "keywords": ["closest", "match", "recommend"],
    "response": "Link them to the closest matching location once you understand their intent."
  },
  {
    "keywords": ["walk-in", "offline", "book in person"],
    "response": "All bookings must be done online. Walk-ins are not allowed."
  },
  {
    "keywords": ["balance", "payment", "cash", "onsite"],
    "response": "Some bookings require balance payment onsite. Most accept card. Danyang and Boryeong in Korea are cash-only."
  },
  {
    "keywords": ["refund", "weather", "cancel"],
    "response": "Refunds are given for weather cancellations or if we cancel for another reason."
  },
  {
    "keywords": ["guest", "bring friend", "non-participant"],
    "response": "Guests can bring non-participants if mentioned in the booking comment."
  },
  {
    "keywords": ["refund", "name", "follow up"],
    "response": "For refunds, ask for the name on the reservation. Let them know we’ll follow up by email."
  },
  {
    "keywords": ["refund", "process", "money back"],
    "response": "Refunds take 5–10 business days to process."
  },
  {
    "keywords": ["help", "unsure", "unknown"],
    "response": "If the bot can’t help or doesn’t know the answer, ask the customer to email us at contact@ascendia-sports.com."
  },
  {
    "keywords": ["payment", "fail", "card declined"],
    "response": "If online card payment fails, tell them to email us to arrange a bank transfer or another solution."
  },
  {
    "keywords": ["reply", "fast", "delay", "emoticon"],
    "response": "Keep replies short and to the point. Sound human. Wait ~20 seconds before replying. No emoticons."
  },
  {
    "keywords": ["date", "time", "choose"],
    "response": "Customers choose the date and time when booking. If it’s available online, it’s available."
  },
  {
    "keywords": ["arrival", "booking time"],
    "response": "The booking time is the arrival time. Guests should arrive at that time or a bit early."
  },
  {
    "keywords": ["contact", "message", "local operator"],
    "response": "After booking, tell the guest the local contact will message them on WhatsApp."
  },
  {
    "keywords": ["discount", "group", "promo"],
    "response": "We offer a 10% discount for 7+ people. They must email us to get a promo code."
  },
  {
    "keywords": ["voucher", "gift", "redeem"],
    "response": "Gift vouchers can be purchased and redeemed on activity pages."
  },
  {
    "keywords": ["activities", "all activities"],
    "response": "Do not list all activities. First ask what activity they want and where they are or plan to go."
  },
  {
    "keywords": ["best", "recommend location", "which place"],
    "response": "If they ask which location is best, recommend the closest one. All are beautiful."
  },
  {
    "keywords": ["emoji", "emotion", "robot"],
    "response": "Do not use emoticons. It looks like AI."
  },
  {
    "keywords": ["info", "too much", "long"],
    "response": "Keep responses short and simple. Avoid giving too much information at once."
  },
  {
    "keywords": ["direction", "where to meet"],
    "response": "If they ask for directions, say the activity page has detailed meetup instructions."
  },
  {
    "keywords": ["send link", "link", "URL"],
    "response": "Do not ask if they want a link. Send the link once the activity and location are clear."
  },
  {
    "keywords": ["seoul", "korea", "yangpyeong", "danyang"],
    "response": "For Korea: recommend Yangpyeong or Danyang for Seoul customers. Recommend Busan/Daegu for those near the south."
  },
  {
    "keywords": ["video", "included", "footage"],
    "response": "Paragliding video is included in Korea, Taiwan, Malaysia, Hong Kong, and Innsbruck. Others may charge extra—check the link."
  },
  {
    "keywords": ["taiwan", "yilan", "hualien", "closed"],
    "response": "Taiwan: Yilan and Hualien paragliding are closed. Recommend Puli and Kaohsiung only."
  },
  {
    "keywords": ["puli", "taxi", "pickup"],
    "response": "Puli paragliding includes pickup anywhere in the Nantou Puli area, and we can help with a return taxi."
  },
  {
    "keywords": ["vienna", "rafting", "austria"],
    "response": "If someone is in Vienna and wants rafting, recommend the closest rafting location."
  },
  {
    "keywords": ["closest", "match", "nearby"],
    "response": "Always try to find the closest location for the activity they want."
  },
  {
    "keywords": ["guest", "friend", "nonparticipant"],
    "response": "Guests can bring non-participants if noted in the booking comment."
  },
  {
    "keywords": ["paid part", "balance", "arrival"],
    "response": "If the guest paid only part online, the rest is due on arrival. The exact amount is on the activity URL."
  },
  {
    "keywords": ["cash", "balance", "card"],
    "response": "Remaining balance can be paid by card at most locations. Danyang, Boryeong, and Innsbruck are cash only."
  }
]
